---
kind: type
id: T:Autodesk.Revit.DB.Revolution
source: html/c79a0527-7887-2fdf-3d8a-a7845cbf18a0.htm
---
# Autodesk.Revit.DB.Revolution

A revolution solid or void form.

## Syntax (C#)
```csharp
public class Revolution : GenericForm
```